app/controllers/categories_controller.rb

  def update
    @category = Category.find(params[:id])
    @category.update(category_params)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "categories" SET "name" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["name", "Harris Coin FIZZAY"], ["updated_at", "2016-05-05 13:52:16.031149"], ["id", 2]]