app/controllers/products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 240]]
SELECT "categories".* FROM "categories"
---
  def edit
    @product = Product.find(params[:id])
    @categories = Category.all

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT 1  [["id", 240]]
UPDATE "products" SET "category_id" = $1, "category_name" = $2, "updated_at" = $3 WHERE "products"."id" = $4  [["category_id", 163], ["category_name", "Speciality Pages"], ["updated_at", "2016-03-11 22:57:53.652472"], ["id", 353]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 163]]
---
  def update
    @product = Product.find(params[:id])
    @product.update(product_params)
    @product.category_id = params[:product][:category]
    @product.category_name = Category.find(params[:product][:category]).name

SELECT "categories".* FROM "categories"
---
  def new
    @product = Product.new
    @categories = Category.all.sample.categories_with_products

SELECT "categories".* FROM "categories" WHERE (parent_key = 'Folders')
---
  def other_index
    @big_categories = Category::CATEGORIES
    @categories = Category.all