app/views/products/edit.html.erb

SELECT "categories".* FROM "categories"
SELECT "products".* FROM "products" WHERE "products"."category_id" = $1  [["category_id", 169]]
---
            <%= f.input :wholesale_price, placeholder: 'Decimal only. e.g. \'10.40\'.' %><br>
             <%= f.input :category,:collection => Category.all.sample.categories_with_products,:label_method => :name, :value_method => :id,:label => "Category", :selected => @product.category_id, :include_blank => false %><br>