app/views/products/other_index.html.erb

              <h2 class="section"><%= category %> </h2>
              <% @categories = Category.where("parent_key = ?", category) %>
---
SELECT "categories".* FROM "categories" WHERE (parent_key = '04P:DD50')